InformationRegisters/упПроизошедшиеСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПроизошедшиеСобытия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОтработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтатусыОтработкиСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПопытки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОтработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРезультат</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.упСогласованиеИзмененийМаршрута</v8:Type>
						<v8:Type>cfg:DocumentRef.упСписаниеПлановПоЗаданиюНаПеревозку</v8:Type>
						<v8:Type>cfg:DocumentRef.упКорректировкаРейса</v8:Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
						<v8:Type>cfg:DocumentRef.упПрохождениеТочки</v8:Type>
						<v8:Type>cfg:DocumentRef.упЗадачаНаОтправкуФайлов</v8:Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
						<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаТС</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.упПодтверждениеАдреса</v8:Type>
						<v8:Type>cfg:DocumentRef.упКорректировкаЭтаповПеревозки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГенерации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упИсходящаяПретензия</v8:Type>
						<v8:Type>cfg:DocumentRef.упПодтверждениеЗаявкиНаТС</v8:Type>
						<v8:Type>cfg:DocumentRef.упШтраф</v8:Type>
						<v8:Type>cfg:DocumentRef.упДокументТранспортногоСредстваВодителя</v8:Type>
						<v8:Type>cfg:DocumentRef.упЗапросУсловийПеревозки</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.упКорректировкаРейса</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапланированноеВзаимодействие</v8:Type>
						<v8:Type>cfg:DocumentRef.упКоммерческоеПредложение</v8:Type>
						<v8:Type>cfg:DocumentRef.упВходящаяПретензия</v8:Type>
						<v8:Type>cfg:DocumentRef.упПересчетГрузовыхМест</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.упСобытиеМониторинга</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
						<v8:Type>cfg:DocumentRef.упФактическиеДоходы</v8:Type>
						<v8:Type>cfg:DocumentRef.упПрохождениеТочки</v8:Type>
						<v8:Type>cfg:DocumentRef.упЗадачаНаОтправкуФайлов</v8:Type>
						<v8:Type>cfg:DocumentRef.Встреча</v8:Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
						<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
						<v8:Type>cfg:DocumentRef.СообщениеSMS</v8:Type>
						<v8:Type>cfg:DocumentRef.упФактическиеРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаТС</v8:Type>
						<v8:Type>cfg:DocumentRef.упПрочиеРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.упРемонтИТОТС</v8:Type>
						<v8:Type>cfg:DocumentRef.упПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.упПроисшествиеВПути</v8:Type>
						<v8:Type>cfg:DocumentRef.упПредложениеПеревозчика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упСтатусыОтработкиСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСтатусыОтработкиСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обрабатывается</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/упПроизошедшиеСобытия/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СнятьПризнакОбработки(Команда)
	
	СнятьПризнакОбработкиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СнятьПризнакОбработкиНаСервере()

	Для Каждого текСтрока Из Элементы.Список.ВыделенныеСтроки Цикл 
		Запись = РегистрыСведений.упПроизошедшиеСобытия.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, текСтрока);
		Запись.Прочитать();
		Запись.ДатаНачалаОбработки = '00010101';
		Запись.СтатусОтработки     = Перечисления.упСтатусыОтработкиСобытий.Открыто;
		Запись.Записать();
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
